<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4d781f6a39d79ec3165f73003a55a8a8dc4d462b3c4df75f570ebe48b66c1e07","plan_job_ref":"Job Terraform plan #31 at https://github.com/mkuthan/stream-processing/actions/runs/7367268997","plan_hash":"9d0a890421af28bdcb73507793cb0e1f48cb124d33712e20db76348d5432fb90","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-entry"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-exit"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
+   resource "google_pubsub_subscription" "vehicle-registration-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "vehicle-registration"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #31](https://github.com/mkuthan/stream-processing/actions/runs/7367268997)